In [44]:
import pandas as pd
# Create dataframe
data = pd.DataFrame({'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]})
data

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [45]:
'GOOG' in data['Company'].to_list()

True

In [46]:
data[data['Company']=='FB']['Person'].iat[0]

'Carl'

In [4]:
data.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [9]:
d = data.groupby('Company')['Sales'].sum().reset_index()
d

  Company  Sales
0      FB    593
1    GOOG    320
2    MSFT    464

In [10]:
d[d['Sales']>450]

  Company  Sales
0      FB    593
2    MSFT    464

### Size()

In [25]:
examinations = pd.DataFrame(
    {
        'student_id':[1,1,1,2,1,1,13,13,13,2,1],
        'subject_name':['Math','Physics','Programming','Programming','Physics','Math','Math','Programming','Physics','Math','Math']
    }
)
examinations

    student_id subject_name
0            1         Math
1            1      Physics
2            1  Programming
3            2  Programming
4            1      Physics
5            1         Math
6           13         Math
7           13  Programming
8           13      Physics
9            2         Math
10           1         Math

In [26]:
examinations.groupby(by=['student_id','subject_name']).size().reset_index(name='attended_exams')

   student_id subject_name  attended_exams
0           1         Math               3
1           1      Physics               2
2           1  Programming               1
3           2         Math               1
4           2  Programming               1
5          13         Math               1
6          13      Physics               1
7          13  Programming               1

In [28]:
ads = pd.DataFrame({
    'ad_id':[1,2,3,5,1,2,3,1,2,1],
    'action':['Clicked','Clicked','Viewed','Ignored','Ignored','Viewed','Clicked','Viewed','Viewed','Clicked']
})
ads

   ad_id   action
0      1  Clicked
1      2  Clicked
2      3   Viewed
3      5  Ignored
4      1  Ignored
5      2   Viewed
6      3  Clicked
7      1   Viewed
8      2   Viewed
9      1  Clicked

### Sub category calculation

In [42]:
ads.groupby('ad_id')['action'].apply(lambda x: round(
    (sum(x=='Clicked')/(sum(x=='Clicked')+sum(x=='Viewed'))*100) if (sum(x=='Clicked')+sum(x=='Viewed')) >0 
    else 0 ,2)).reset_index()

   ad_id  action
0      1   66.67
1      2   33.33
2      3   50.00
3      5    0.00

In [48]:
activities = pd.DataFrame({
    'sell_date':['2020-05-30', '2020-06-01','2020-06-02','2020-05-30', '2020-06-01','2020-06-02','2020-05-30'],
    'product':['Headphone','Pencil','Mask','Basketball','Bible','Mask','T-Shirt']
})
activities

    sell_date     product
0  2020-05-30   Headphone
1  2020-06-01      Pencil
2  2020-06-02        Mask
3  2020-05-30  Basketball
4  2020-06-01       Bible
5  2020-06-02        Mask
6  2020-05-30     T-Shirt

In [61]:
ac_groups = activities.groupby('sell_date')
ac_groups.agg(
    num_sold = ('product', 'nunique'),
    products = ('product', lambda x:' '.join(sorted(set(x))))
)

            num_sold                      products
sell_date
2020-05-30         3  Basketball Headphone T-Shirt
2020-06-01         2                  Bible Pencil
2020-06-02         1                          Mask

In [64]:
employee = pd.DataFrame({
    'id':[1,2,3,4,5],
    'name':['Joe','Jim','Henry','Sam','Max'],
    'salary':[70000,90000,80000,60000,90000],
    'departId':[1,1,2,2,1]
})
employee

   id   name  salary  departId
0   1    Joe   70000         1
1   2    Jim   90000         1
2   3  Henry   80000         2
3   4    Sam   60000         2
4   5    Max   90000         1

In [72]:
# find highest salary per department
max_series = employee.groupby('departId')['salary'].transform(max)
employee[employee['salary']==max_series]

   id   name  salary  departId
1   2    Jim   90000         1
2   3  Henry   80000         2
4   5    Max   90000         1